<!doctype html>
<html lang="fr">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
  <meta http-equiv="X-UA-Compatible" content="ie=edge">
  <title>Document</title>
  <link href="https://fonts.googleapis.com/css?family=Lato&amp;display=swap" rel="stylesheet">
  <link rel="stylesheet" href="http://78.47.40.9/css/main.css">
  <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
  <script src="/js/jquery-3.4.1.min.js"></script>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.14.7/umd/popper.min.js" integrity="sha384-UO2eT0CpHqdSJQ6hJty5KVphtPhzWj9WO1clHTMGa3JDZwrnQq4sF86dIHNDz0W1" crossorigin="anonymous"></script>
  <script src="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/js/bootstrap.min.js" integrity="sha384-JjSmVgyd0p3pXB1rRibZUAYoIIy6OrQ6VrjIEaFf/nJGzIxFDsf4x0xIM+B07jRM" crossorigin="anonymous"></script>
  <script src="/js/script.js"></script>
  <style>
    body {
      max-width: 1000px;
      margin: 0 auto;
    }
  </style>
</head>
<body>
<h1 style="padding-top: 60px;">Что нового?)</h1>
<div class="news">
  <div class="news-item">
    <p class="news-text">
      Поменял структуру на главной странице. Жирные черные - это папки, обычным шрифтом - файлы. Работает все точно также, просто поменялся вид. В будущем поможет вам создавать
      свою структуру в своих файлах.
    </p>
    <h5>Изменение на титульной странице</h5>
    <p class="news-text">
      Я очень старался, надеюсь вы оцените) <br>
      Теперь на главной странице в программе(там, где картинку на задний фон ставите) можно передвигать блоки, как вашей душе угодно) <br>
      Для того, чтобы передвигать элементы вам нужно быть <b>в режиме чтения!</b>. Для этого необходимо нажать на кнопку в шапке "Режим редактирования/чтения" или нажать клавиши
      ctrl + 4. Затем мышкой просто перетаскиваете элементы. Всего 4 элемента: "Название компании", "Для кого программа", "Даты, дни и направление", "Описание". <br>
      Когда будете делать первый раз на новой программе, текст будет прыгать вверх, просто расставьте все элементы так, как вам необходимо. Не пугайтесь, возможно, звучит
      сложно, но на деле все легко) <br>
      Будут проблемы, пишим, всегда на связи)
    </p>
    <span class="news-date">
      19.03.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Совсем забыл о самой важной новой функии, которая появилась случайно(о хвала всемогущим браузерам). В режиме редактирования нажимаете правой кнопкой мыши на экран и будет
      вкладка "Эмодзи". А вдруг кому то пригодится))
      <img src="/static/emodzi.png" alt="" width="100%">
    </p>
    <span class="news-date">
      13.03.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Добавил кнопку включения/отключения режима редактирования, если вдруг не будет работать какая то кнопка(например, загрузки картинок), ссылка, попробуйте перейти в режим
      чтения (особенно касается мозилы)
    </p>
    <span class="news-date">
      11.03.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Добавил возможность удалять программы со страницы
      <a href="/all">всех программ</a>
      и
      <a href="/profile">из профиля.</a>
      <br>
      Нажимаете крестик, подтверждаете и программа удалилась. <br>
      P.S. Возможность вернуть программу есть, но все равно внимательнее)
    </p>
    <span class="news-date">
      10.03.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Появилось много нового функционала, а также переписан и обновлен старый!)
    </p>
    <ol>
      <li>Удалена вкладка "Текст" и весь ее функционал перенесен в верхнее липкое меню</li>
      <li>Из вкладки "Меню" удалена кнопка установки цвета на главной странице, функционал перенесен в верхнее липкое меню</li>
      <li>
        Добавлена вкладка "Шаблоны", в которой вы можете самостоятельно сохранять нужные программы в общие шаблоны, которые находятся на главной странице
      </li>
      <li>Редактирование страницы теперь работает при обычном одиночном нажатии мышкой. Есть режим редактирования, когда видны пункты меню и можно редактировать страницу, а есть
        режим чтения, без возможности редактировать страницу. Для переключения между режимами нажимать кнопки "ctrl + 4"
      </li>
    </ol>
    <p class="news-text">
      Подробнее о верхнем меню. Весь функционал очень схож с Word. Все кнопки подписаны при наведении на них, если вдруг забыли, что они значат.
    </p>
    <img src="/uploads/tempsnip.png" alt="" width="100%">
    <ol>
      <li>Отмена действий. Позволяет отменять ваши действия, работает хорошо. В тестах отменял все изменения, вплоть до первоначальной версии документа.</li>
      <li>Повтор действия. Позволяет повторить отмененное действие.</li>
      <li>Сделать выделенный текст жирным. При повторном нажатии снимает убирает форматирование (ctrl + b).</li>
      <li>Сделать выделенный текст курсивом. При повторном нажатии снимает убирает форматирование (ctrl + i).</li>
      <li>Сделать выделенный текст подчеркнутым. При повторном нажатии снимает убирает форматирование (ctrl + u).</li>
      <li>Сделать выделенный текст зачеркнутым. При повторном нажатии снимает убирает форматирование.</li>
      <li>Сделать выделенный текст надстрочным.</li>
      <li>Сделать выделенный текст подстрочным.</li>
      <li>Убрать все форматирование с выделенного текста.</li>
      <li>Выравнивание текста по левому краю</li>
      <li>Выравнивание текста по центру</li>
      <li>Выравнивание текста по правому краю</li>
      <li>Выравнивание по ширине</li>
      <li>Установить на выделенный текст ссылку</li>
      <li>Удалить выделенную ссылку</li>
      <li>Сделать нумерованный список</li>
      <li>Сделать маркерованнный список</li>
      <li>Добавить горизонтальную линию</li>
      <li>Поменять цвет выделенного текста, на тот, который выбран в 20 пункте</li>
      <li>Выбрать цвет шрифта</li>
      <li>Поменять цвет фона выделенного текста, на тот, который выбран в 22 пункте</li>
      <li>Выбрать цвет фона</li>
      <li>Поменять шрифт у выделенного текста, на тот, который выбран в 24 пункте</li>
      <li>Выбрать шрифт</li>
      <li>Поменять размер шрифта у выделенного текста, на тот, который выбран в 26 пункте</li>
      <li>Выбрать размер шрифта</li>
    </ol>
    <p class="news-text">
      Я надеюсь данные изменения значительно упростят вам редактирование программ. работа над дальнейшими улучшениями продолжается. <br>
      Обо всех ошибках и пожеланиях пишем, не стесняемся) <br>
      В ближайшее время постараюсь что-то придумать с главной страницей, чтобы максимально облегчить наведение красоты на ней
    </p>
    <span class="news-date">
      08.03.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      В таблицу с ценами можно добавлять строку по центру
    </p>
    <span class="news-date">
      04.03.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      При закрытии и обновлении стрницы дополнительно справшивает уверены ли вы, что хотите закрыть окно, в будущем улучшу, но пока предотвратит случайные закрытия страницы)
    </p>
    <span class="news-date">
      26.02.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Появилась возможность менять цвет текста. Выделяем слово, нажимает кнопку "Текст", видим строку "Установить цвет" и рядом квадратик с выбранным цветом(по умолчанию черный).
      <br>
      Для того, чтобы помнять цвет, нажимаем на квадратик справа от слов "Установить цвет" и выбираем нужный вам, нажимаем ок. Квадратик будет указывать цвет, который вы выбрали.
      <br>
      Затем нажимаем "Установить цвет" и вуаля, все красиво).
      <br>
      <br>
      Для первой страницы(с картинкой на заднем плане) сделал отдельную кнопку, которая находится в пункте "Меню" -> "Цвет текста на главной странице".
      Она меняет весь текст (кроме russieautrement) на выбранный вами цвет, аналогично как писал выше)
    </p>
    <span class="news-date">
      19.02.2020
    </span>
  </div>
  <div class="news-item">
    <h6>Регистрация</h6>
    <p class="news-text">
      Теперь у нас появилась регистрация.
      <br>
      Просьба всем зарегистрироваться по
      <a href="/register">ссылке</a>
      <br>
      Со всеми пунктами думаю все понятно, могу уточнить только про поле "Индивидуальный код" - это первые буквы в названии программ. Он нужен для того, чтобы в вашем профиле
      показывались только ваши программы, для
      удобства.
      <br>
      Все данные можно будет изменить в дальнейшем)
      <br>
      Затем вам необходимо
      <a href="/login">войти</a>
      в профиль
    </p>
    <h6>Профиль</h6>
    <p class="news-text">
      В профиле показывает вашу карточку с данными, которые можно поменять нажав на кнопку "Изменить"
      <br>
      Ниже показывает ваши программы.
    </p>
    <h6>Новый дизайн</h6>
    <p class="news-text">
      Теперь появилась титульная страница. На которую вы можете добавлять задним фоном красивую картинку. Для этого нажимаете "Меню" -> "Картинка на главную страницу".
      <br>
      Если это программа в новом дизайне, но без титульной страницы, вы можете добавить ее! Для этого нажимаете "Меню" -> "Добавить главную страницу". И затем уже можете
      добавить фоновую картинку)
      <br>
      Ниже идет карточка с вашими данными(такая же как в профиле). Она вставляется автоматически. Данные можно поменять в профиле.
    </p>
    <h6>Таблица с ценами</h6>
    <p class="news-text">
      Добавилась кнопка "Еще таблицу". При нажатии которой добавляется еще одна таблица ниже. Также есть кнопка удалить таблицу, если вдруг она лишняя)
    </p>

    <p class="news-text">
      Из-за массовых обновлений возможны ошибки. Если что-то обнаружите напише мне, пожалуйста). Но, надеюсь, мы будет без ошибок)
    </p>

    <span class="news-date">
      11.02.2020
    </span>
    <!-- LikeBtn.com BEGIN -->
    <span class="likebtn-wrapper" data-theme="custom" data-icon_l="hrt1" data-icon_l_c_v="#c73728" data-lang="ru" data-ef_voting="push" data-identifier="item_11.02.2020" data-popup_disabled="true" data-share_enabled="false"></span>
    <script>(function (d, e, s) {
        if (d.getElementById("likebtn_wjs")) return;
        a = d.createElement(e);
        m = d.getElementsByTagName(e)[0];
        a.async = 1;
        a.id = "likebtn_wjs";
        a.src = s;
        m.parentNode.insertBefore(a, m)
      })(document, "script", "//w.likebtn.com/js/w/widget.js");</script>
    <!-- LikeBtn.com END -->
  </div>
  <div class="news-item">
    <h5>Для нового дизайна</h5>
    <h6>Блок что включено и не включено.</h6>
    <p class="news-text">
      Вынес кнопки "Добавить пункт" в отдельное меню "Действие". Аналогично функционалу в днях.<br>
      "Добавить галочки" - добавляет в столбик включено, "Добавить крестики" - добавляет в столбик не включено. <br>
      Также появился новый пункт "Добавить текст". При нажатии на него, выскакиевает поле с возможностью вставить скопированный текст или набрать его вручную.
      <b>Каждый пункт списка должен начинаться с новой строки!</b>, затем нажимаете "Вставить к галочкам/крестикам" и все ваши пункты аккуратно встают на свое место, заменяя
      старые пункты. <br>
      Удобно, когда вы хотите полностью скопировать что включено/не включено из другой программы. Просто попробуйте и сразу станет понятно)
    </p>
    <h6>Новая кнопка в меню справа "Элементы" и маленькие крестики у некоторых блоков.</h6>
    <p class="news-text">
      Данный функционал позволяет скрыть не нужные вам блоки. Если галочка стоит, блок скрыт, но его всегда можно вернуть, сняв галочку. Для того чтобы скрыть блок, можно
      поставить галочку или нажать на крестик рядом с данным блоком. <br>
      Если блоки назвал неправильно(не удобно для вас), а также если нужно иметь возможность скрывать какие-либо блоки еще, пишите мне, обязательно поправим.
    </p>
    <p class="news-text">
      Появились лайки в новостях!)) Очень важное дополнение))
    </p>
    <span class="news-date">
      28.01.2020
    </span>
    <!-- LikeBtn.com BEGIN -->
    <span class="likebtn-wrapper" data-theme="custom" data-icon_l="hrt1" data-icon_l_c_v="#c73728" data-lang="ru" data-ef_voting="push" data-identifier="item_28.01.2020" data-popup_disabled="true" data-share_enabled="false"></span>
  </div>
  <div class="news-item">
    <h5>Для нового дизайна</h5>
    <p class="news-text">
      При нажатии на кнопку "Удалить день" будет выпадать окно с подтверждением, для исключения случайных удалений.
      <br>
      <br>
      Появились кнопки "&#8743;/&#8744;", которые позволяют свернуть день, чтобы он меньше занимал места, для удобства навигации.
      <br>
      <br>
      Появились стрелочки для перемещения дня. Теперь можно поменять дни местами быстро и удобно)
      <br>
      <br>
      При повторном применении "Жирный/Курсив/Подчеркнутый" на тот же самый элемент будет отменяться его оформление.
    </p>
    <span class="news-date">
      17.01.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Добавил кнопку "Добавить день до". На случай, если нужно будет добавить день перед первым днем)
    </p>
    <span class="news-date">
      14.01.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      А вот уже и прошел новый год, а значит время новых обновлений. Добавил долгожданное форматирование текста.
      Теперь можно делать текст жирным, курсивным, подчеркнутым, а также менять размер шрифта.
      Под меню появилась новая кнопка "Текст", при нажатии которой выпадают пункты.
      Все работает аналогично Word'у, выделяете необходимый текст, нажимается необходимую кнопку, вуаля, все готово) <br>
      Также, для вашего удобства, добавил горячие клавиши:
    </p>
    <ul>
      <li>ctrl + b - Сделать текст жирным</li>
      <li>ctrl + i - Сделать текст курсивным</li>
      <li>ctrl + u - Сделать текст подчеркнутым</li>
      <li>ctrl + [ - Уменьшить размер шрифта</li>
      <li>ctrl + ] - Увеличить размер шрифта</li>
    </ul>
    <span class="news-date">
      07.01.2020
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Появился новый дизайн программ, можно(и нужно) пользоваться им, взять ее можно во
      <a href="http://78.47.40.9/index.php?inDir=french">франзуском направлении</a>
      под названием "new". <br>
      Функционал остался прежним, немного обновлены кнопки для вашего удобства, все спрятано в одно удобное меню.
      Если нужен быдет какой-либо еще функционал или помощь по текущему, пишем не стесняемся, разберемся, поможем) <br>
      Всех с наступающим Новым Годом!
    </p>
    <span class="news-date">
      31.12.2019
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Добавил автосохранение файла. Теперь ваши программы сохраняются автоматически каждые 5 мин. Если вы вдруг обнаружили, что ваша программа не сохранилась, то:
    </p>
    <ul>
      <li>Переходим по
        <a href="/autosave">данной ссылке</a>
      </li>
      <li>Ищем свою программу</li>
      <li>Радуемся</li>
      <li>Нажимаем на кнопку "Сохранить файл" или ctrl + s</li>
      <li>И возвращаемся к своему файлу, который делали ранее, его можно найти
        <a href="/all">тут</a>
        , если потеряли
      </li>
    </ul>
    <span class="news-date">
      26.12.2019
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Шаблоны рассортированы по языкам
    </p>
    <span class="news-date">
      16.12.2019
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Теперь появилась возможность добавлять блок с фотографиями внутри текста дня
    </p>
    <span class="news-date">
      12.12.2019
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Можно называть файлы с пробелами, автоматически заменит их нижним подчеркиванием, чтобы избежать проблем.
      Также на странице всех туров сделал сортировку по алфавиту, что, надеюсь, должно немного облегчить поиск программы)
    </p>
    <span class="news-date">
      10.12.2019
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Чтобы удобно оповещать вас, что появилось нового, создал для этого отдельную страницу. Теперь есть возможно посмотреть все обновления и не стоит переживать,
      что вы что-то пропустили)
      <a href="/news">Что новенького?)</a>
      Все ваши пожелания стараюсь учитывать, чтобы вам было комфортно работать)
    </p>
    <span class="news-date">
      09.12.2019
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Теперь есть удобные кнопки добавления не только столбика, но и строки в ценах)
    </p>
    <span class="news-date">
      06.12.2019
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Номер дня ставится автоматически, но не забываем проверять) Хорошего дня)
    </p>
    <span class="news-date">
      05.12.2019
    </span>
  </div>
  <div class="news-item">
    <p class="news-text">
      Появилась новая страница со всеми вашими программами, если вдруг потеряли или забыли записать не стоит грустить, лучше сделать чашечку кофе и найти вашу прогрумма
      по названию среди всех, когда-нибудь разделим по каждому лично, чтобы было максимально удобно*_*. А вот и
      <a href="/all">ссылочка</a>
    </p>
    <span class="news-date">
      01.12.2019
    </span>
  </div>
</div>
</body>
</html>
